app/controllers/images_controller.rb

  def index
    @images = Image.all
---
SELECT "images".* FROM "images"

  def create
    @image = Image.new(image_params)

    respond_to do |format|
      if @image.save
---
INSERT INTO "images" ("src", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["src", "default.png"], ["project_id", 1], ["created_at", "2021-04-07 04:08:47.970861"], ["updated_at", "2021-04-07 04:08:47.970861"]]

    def set_image
      @image = Image.find(params[:id])
---
SELECT "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]