app/controllers/projects_controller.rb

UPDATE "projects" SET "description" = $1, "updated_at" = $2 WHERE "projects"."id" = $3
---
  def update
    if user_signed_in?
        respond_to do |format|
        if @project.update(project_params)

DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 1]]
---
  def destroy
    if user_signed_in?
        @project.destroy